app/controllers/samples_controller.rb

SELECT * FROM "analytics"
---
  def visitors_report
    a = Analytic.all

SELECT * FROM "sales" WHERE ("sales"."territory" = 'Brazil')
---
  def sales_report
    sales = Sale.all( :conditions => { :territory => 'Brazil' } )